import React from 'react';

import styles from './LessonCard.module.css';

const LessonCard = () => {
  return (
    <div className={styles.lessonCard}>
      Петя при выезде из Москвы, оставив своих родных, присоединился к своему полку и скоро после этого был взят
      ординарцем к генералу, командовавшему большим отрядом. Со времени своего производства в офицеры, и в особенности с
      поступления в действующую армию, где он участвовал в Вяземском сражении, Петя находился в постоянно
      счастливо-возбужденном состоянии радости на то, что он большой, и в постоянно восторженной поспешности не
      пропустить какого-нибудь случая настоящего геройства. Он был очень счастлив тем, что он видел и испытал в армии,
      но вместе с тем ему все казалось, что там, где его нет, там-то теперь и совершается самое настоящее, геройское. И
      он торопился поспеть туда, где его не было.{' '}
      <img
        src="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcReWigObCg7ZtupjsFWb3zvIE0yPWwf9xN6ErcvYSxjumgK2rLDaDxKCZN8uWtrOqsvhO4&usqp=CAU"
        alt="kartinka"
        width="100%"
      />
      Когда 21-го октября его генерал выразил желание послать кого-нибудь в отряд Денисова, Петя так жалостно просил,
      чтобы послать его, что генерал не мог отказать. Но, отправляя его, генерал, поминая безумный поступок Пети в
      Вяземском сражении, где Петя, вместо того чтобы ехать дорогой туда, куда он был послан, поскакал в цепь под огнем
      французов и выстрелил там два раза из своего пистолета, — отправляя его, генерал именно запретил Пете участвовать
      в каких бы то ни было действиях Денисова. От этого-то Петя покраснел и смешался, когда Денисов спросил, можно ли
      ему остаться. До выезда на опушку леса Петя считал, что ему надобно, строго исполняя свой долг, сейчас же
      вернуться. Но когда он увидал французов, увидал Тихона, узнал, что в ночь непременно атакуют, он, с быстротою
      переходов молодых людей от одного взгляда к другому, решил сам с собою, что генерал его, которого он до сих пор
      очень уважал, — дрянь, немец, что Денисов герой, и эсаул герой, и что Тихон герой, и что ему было бы стыдно уехать
      от них в трудную минуту. Уже смеркалось, когда Денисов с Петей и эсаулом подъехали к караулке. В полутьме
      виднелись лошади в седлах, казаки, гусары, прилаживавшие шалашики на поляне и (чтобы не видели дыма французы)
      разводившие красневший огонь в лесном овраге. В сенях маленькой избушки казак, засучив рукава, рубил баранину. В
      самой избе были три офицера из партии Денисова, устроивавшие стол из двери. Петя снял, отдав сушить, свое мокрое
      платье и тотчас принялся содействовать офицерам в устройстве обеденного стола.
    </div>
  );
};

export default LessonCard;
